Repository: Alexey-T/cuda_exttools
Catalog: lang/*/LC_MESSAGES/cuda_exttools.po
Languages: ru_ru

source: Ignore
ru_ru: Не сохранять

source: Output panel
ru_ru: Вывести в панель Вывод

source: Output panel (append)
ru_ru: Добавить в панель Вывод

source: Copy to new document
ru_ru: Вывести в новый документ

source: Copy to clipboard
ru_ru: Сохранить в буфере

source: Replace selection
ru_ru: Подставить вместо выделения

source: Nothing
ru_ru: Ничего не сохранять

source: Current document
ru_ru: Только текущий документ

source: All documents
ru_ru: Все документы

source: &Tools
ru_ru: За&пуски

source: Con&fig...
ru_ru: Н&астроить

source: R&un lexer main Tool
ru_ru: Основной &запуск для лексера

source: Resul&ts
ru_ru: Р&езультаты

source: Nex&t Tool result
ru_ru: Сл&едующий результат

source: &Previous Tool result
ru_ru: Предыдущий ре&зультат

source: No main Tool for lexer "{}"
ru_ru: Не задан основной запуск для лексера "{}"

source: No Tool: {}
ru_ru: Нет запуска {}

source: Tool "{}" is not suitable for lexer "{}". It works only with "{}"
ru_ru: Запуск "{}" не сочетается с лексером "{}". Только для "{}"

source: Fail call: {} {}
ru_ru: Сбой при запуске: {} {}

source: Call: {} {}
ru_ru: Запуск: {} {}

source: No Tool to parse the output line
ru_ru: Строка не ассоциирована ни с одним Запуском

source: Tool "{}" has not Pattern property
ru_ru: У запуска "{}" нет Шаблона для разбора вывода

source: Tool "{}" could not find a line-number into output line
ru_ru: Не найдена информация о номере строки после Запуска "{}"

source: Cannot open: {}
ru_ru: Не удается открыть {}

source: No any results for navigation
ru_ru: Нет результатов вывода для перехода

source: No more results for navigation
ru_ru: Нет следующего результата для перехода

source: Need update CudaText
ru_ru: Необходимо обновить CudaText

source: Join several Tools to single Tool
ru_ru: Объединить несколько запусков в один

source: Move current Tool to upper position
ru_ru: Пеместить на одну позицию вверх

source: Move current Tool to lower position
ru_ru: Пеместить на одну позицию вниз

source: For call by command "Run lexer main Tool"
ru_ru: Установки для применения команды "Главный запуск лексера"

source: Edit list of user's macros to use in Tool properties
ru_ru: Список пользов. макроподстановое для вставки в парам. Запуска

source: Change this dialog sizes
ru_ru: Настроить размеры этого диалога

source: Name
ru_ru: Имя

source: Keys
ru_ru: Сочетание

source: File | [Tools]
ru_ru: Команда | [Запуски]

source: Params
ru_ru: Параметры

source: Folder
ru_ru: Исх. папка

source: Lexers
ru_ru: Лексеры

source: Capture
ru_ru: Результаты

source: Saving
ru_ru: Сохранение

source: &Tools ({})
ru_ru: За&пуски ({})

source: &Edit...
ru_ru: &Изменить...

source: &Add...
ru_ru: &Создать...

source: Jo&in...
ru_ru: Об&ъединить...

source: Clo&ne
ru_ru: &Дублировать

source: &Delete...
ru_ru: &Удалить...

source: &Up
ru_ru: Подн&ять

source: Do&wn
ru_ru: &Опустить

source: Set &main for lexers...
ru_ru: Основные для &лексеров...

source: User macro &vars...
ru_ru: Пользов. &макроподстановки...

source: Ad&just...
ru_ru: Подстроит&ь...

source: Close
ru_ru: Закрыть

source: Tools
ru_ru: Запуски

source: Custom dialog Tools. Start Widths with "R"/"C" to align. Start with "-" to hide column.
ru_ru: Подстройка диалога. Начните с "R"/"C" для выравнивания. Начните с "-", чтобы спрятать колонку.

source: Width of Name (min 100)
ru_ru: Ширина Имя (мин 100)

source: Width of Keys (min 50)
ru_ru: Ширина Сочетания (мин 50)

source: Width of File (min 150)
ru_ru: Ширина Файл (мин 150)

source: Width of Params (min 150)
ru_ru: Ширина Параметры (мин 150)

source: Width of Folder (min 100)
ru_ru: Ширина Папка (мин 100)

source: Width of Lexers (min 50)
ru_ru: Ширина Лексеры (мин 50)

source: Width of Capture (min 50)
ru_ru: Ширина Вывод (мин 50)

source: Width of Saving (min 30)
ru_ru: Ширина Сохранять (мин 30)

source: List height (min 200)
ru_ru: Высота списка (мин 200)

source: Button width (min 70)
ru_ru: Ширина кнопок (мин 70)

source: Delete Tool?
ru_ru: Удалить Запуск?

source: Delete with joined Tool(s)
ru_ru: Удалить вместе с объединенным(и) Запуском(ами)

source: &Lexer >>> main Tool
ru_ru: &Лексер >>> основной Запуск

source: &Assign Tool
ru_ru: &Назначить Запуск

source: &Break link
ru_ru: Раз&орвать связь

source: Main Tool for lexers
ru_ru: Основные Запуски для лексеров

source: Comment
ru_ru: Комментарий

source: Value
ru_ru: Значение

source: User macro &vars
ru_ru: Пользов. &макроподстановки

source: Eva&luate...
ru_ru: &Рассчитать...

source: User macro vars
ru_ru: Пользов. макроподстановки

source: &Name:
ru_ru: &Имя:

source: Val&ue:
ru_ru: Зна&чение

source: Add &file...
ru_ru: &Файл...

source: Add &dir...
ru_ru: &Папка...

source: Add &var...
ru_ru: &Макро...

source: &Comment:
ru_ru: &Комментарий:

source: Cancel
ru_ru: Отмена

source: Edit user macro var
ru_ru: Изменить польз. макроподстановку

source: Set Name
ru_ru: Задайте Имя

source: Set Value
ru_ru: Задайте Выражение

source: Delete Macro?
ru_ru: Удалить макроподстановку?

source: Name: {}
ru_ru: Имя: {}

source: Value: {}
ru_ru: Значение: {}

source: Comment: {}
ru_ru: Коммент.: {}

source: Select Tools for join
ru_ru: Укажите Запуски для объединения

source: &Name
ru_ru: &Имя

source: Se&ries
ru_ru: Списо&к

source: &Select...
ru_ru: Выбрат&ь...

source: Vie&w...
ru_ru: П&росмотр...

source: &Down
ru_ru: &Опустить

source: &File name
ru_ru: &Файл

source: &Browse...
ru_ru: &Найти...

source: &Shell command
ru_ru: &Shell команда

source: &Parameters
ru_ru: Парамет&ры

source: A&dd...
ru_ru: &Добавить...

source: &Initial folder
ru_ru: &Папка

source: B&rowse...
ru_ru: Выбрат&ь...

source: Le&xers...
ru_ru: Лексер&ы...

source: Main for
ru_ru: Основной для

source: Set &main...
ru_ru: Назна&чить...

source: Sa&ve before
ru_ru: Со&хранить до

source: Hotkey
ru_ru: Сочетание

source: Assi&gn...
ru_ru: Назначить...

source: &Capture output
ru_ru: &Вывод

source: Encoding
ru_ru: Кодировка

source: S&elect...
ru_ru: Выбрать...

source: Pattern
ru_ru: Шаблон

source: Se&t...
ru_ru: Настроить...

source: Advanced
ru_ru: Доп.свойства

source: Set...
ru_ru: Задать...

source: Help
ru_ru: Справка

source: Tool properties
ru_ru: Свойства Запуска

source: Set File name
ru_ru: Задайте Имя файла

source: In Tool properties File name Parameters Initial folder the following macros are processed. - Application macros: {AppDir} - Directory with app executable {AppDrive} - (Win only) Disk of app executable, eg "C:" - Currently focused file macros: {FileName} - Full path {FileDir} - Folder path, without file name {FileNameOnly} - Name only, without folder path {FileNameNoExt} - Name without extension and path {FileExt} - Extension - Currently focused editor macros (for top caret): {CurrentLine} - text {CurrentLineNum} - number {CurrentLineNum0} - number {CurrentColumnNum} - number {CurrentColumnNum0}- number {SelectedText} - text - Prompted macros: {Interactive} - Text will be asked at each running {InteractiveFile} - File name will be asked
ru_ru: В свойствах Запуска Имя файла Параметры Стартовая папка выполняются следующие подстановки. - Информация о приложение: {AppDir} - Папка, содержащая exe {AppDrive} - (только для Win) Буква диска, например, "C:" - Информация об открытом файле: {FileName} - Полный путь {FileDir} - Только папка {FileNameOnly} - Только имя {FileNameNoExt} - Только имя без расширения {FileExt} - Расширение - Информация о текущем тексте (по верхней каретке): {CurrentLine} - текст строки {CurrentLineNum} - номер строки {CurrentLineNum0} - номер строки при нумерации с 0 {CurrentColumnNum} - номер колонки {CurrentColumnNum0}- номер колонки при нумерации с 0 {SelectedText} - выделенный текст - Информация, запрашиваемая у пользователя: {Interactive} - Свободный текст {InteractiveFile} - Имя файла

source: Tool macros
ru_ru: Подстановки

source: Select lexers
ru_ru: Задать лексеры

source: Advanced properties
ru_ru: Доп. свойства

source: &Regular expression
ru_ru: &Регулярное выражение

source: Test "&Output line"
ru_ru: Строка &для проверки

source: &Test
ru_ru: &Протестировать

source: Testing results
ru_ru: Результаты тестирования

source: Filename
ru_ru: Файл

source: Line
ru_ru: Строка

source: Column
ru_ru: Колонка

source: Load &preset...
ru_ru: &Загрузить пресет

source: &Save as preset...
ru_ru: Сохранить &как пресет

source: Tool "{}" output pattern
ru_ru: Шаблон выходных строк для Запуска "{}"

source: Set "Regular expression"
ru_ru: Задайте рег.выражение

source: Name for preset ({})
ru_ru: Имя для пресета ({})
